Repository: autohotkey-docs-translation/v1-pt-br
Catalog: omegat/project_save.tmx
Source language: en
Languages: pt_br

source: Right-click the tray icon to show the tray menu, which has the following options by default:
pt_br: Clique com o botão direito no ícone da bandeja para exibir o menu, que tem as opções seguintes por padrão:

source: Run Script
pt_br: Run Script (Executar Script)

source: Run a Script
pt_br: Executar um script

source: Run as administrator (if UAC was enabled when AutoHotkey was installed)
pt_br: Run as administrator (Executar como administrador, se a UAC estava habilitada no momento em que o AutoHotkey foi instalado)

source: Run the CHM file as administrator or create the config file manually.
pt_br: Execute o arquivo CHM como administrador ou crie o arquivo de configuração manualmente.

source: Run the script as administrator.
pt_br: Execute o script como administrador.

source: Run this code to see your AHK version:
pt_br: Execute este código para ver a versão de seu AutoHotkey:

source: Run with UI Access
pt_br: Executar com acesso de IU

source: Run with UI Access (if the option was enabled during installation)
pt_br: Run with UI Access (Executar com Acesso à IU, se a opção estava marcada durante a instalação)

source: Run with UI Access [v1.1.24.02+]
pt_br: Executar com acesso de IU [v1.1.24.02+]

source: Run, %A_ProgramFiles%\Some Application\App.exe, %A_ProgramFiles%\Some Application
pt_br: Run, %A_ProgramFiles%\Um Programa\App.exe, %A_ProgramFiles%\Um programa

source: Run, mspaint.exe
pt_br: Run, mspaint.exe ; Abre o Paint.

source: Running Programs & Websites
pt_br: Executando programas e abrindo sites da web

source: Running a non-UIA script which uses a mouse hook (even as simple as #InstallMouseHook) may prevent all mouse hotkeys from working when the mouse is pointing at a window owned by a UIA script, even hotkeys implemented by the UIA script itself.
pt_br: Executar um script sem UIA que usa um gancho de mouse (mesmo se for tão simples quanto #InstallMouseHook) pode impedir o funcionamento de todas as hotkeys de mouse quando o mouse estiver apontando para uma janela pertencente a um script com UIA, mesmo hotkeys implementadas pelo próprio script UIA.

source: Same as above, but you are assigning a value of a variable to another variable.
pt_br: O mesmo de antes, mas agora você está atribuindo o valor de uma variável a outra variável.

source: Same with hotkeys.
pt_br: O mesmo para as hotkeys.

source: Save settings
pt_br: Salvar configurações

source: Save the File.
pt_br: Salve o arquivo.

source: Save the script as UTF-8 with BOM.
pt_br: Salve o arquivo do script como UTF-8 com BOM.

source: Scientific notation is also recognized, but only if a decimal point is present (e.g. 1.0e4 and -2.1E-4).
pt_br: Notação científica também é reconhecida, mas somente se uma casa decimal estiver presente (exemplo: 1.0e4 e -2.1E-4).

source: Script authors can use the #Warn directive to help find instances where a variable is used without having been initialised by the script.
pt_br: Autores de scripts podem usar a diretiva #Warn para ajudar a encontrar instâncias em que uma variável é usada sem ter sido inicializada pelo script.

source: Scripts are also forced to exit when Windows shuts down.
pt_br: Scripts também são forçados a fechar quando o Windows é desligado.

source: Scripts can also be compiled; that is, combined together with an AutoHotkey binary file to form a self-contained executable (.exe) file.
pt_br: Scripts também podem ser compilados; isto é, combinados com um arquivo binário do AutoHotkey para formar um arquivo executável independente (.exe).

source: Scripts interact with an object only indirectly, through a reference to the object.
pt_br: Scripts interagem com um objeto só indiretamente, através de uma referência ao objeto.

source: Scripts may be embedded into a standard AutoHotkey .exe file by adding them as Win32 (RCDATA) resources.
pt_br: Scripts podem ser incorporados a um executável padrão do AutoHotkey (.exe) adicionando-se-os como recursos Win32 (RCDATA).

source: Scripts which need to run other scripts with UI access can simply Run the appropriate UIA.exe file with the normal command line parameters.
pt_br: Scripts que precisam executar outros scripts com acesso à IU podem simplesmente executar (Run) o arquivo UIA.exe apropriado com os parâmetros da linha de comando normais.

source: Scripts work a little differently.
pt_br: Scripts funcionam de um jeito um pouco diferente.

source: Scroll down to the bottom of the page.
pt_br: Role para baixo até o fim da página.

source: Search
pt_br: Pesquisar

source: Search within all Program Files folders for AutoHotkey.
pt_br: Procure dentro de todos as pastas de Arquivos de programas pelo AutoHotkey.

source: See Automating Winamp.
pt_br: Vide Automatização do Winamp.

source: See GDI+ standard library by tic.
pt_br: Vide biblioteca padrão GDI+, por tic.

source: See Passing Command Line Parameters to a Script for command line usage, including a list of command line switches which affect the program's behavior.
pt_br: Veja Passando Parâmetros da Linha de Comando para um Script para referência sobre o uso da linha de comando, inclusive uma lista de switches que afetam o comportamento do programa.

source: See Portability of AutoHotkey.exe.
pt_br: Vide Portabilidade do AutoHotkey.exe.

source: See Scripting Language for details about how to write a script.
pt_br: Veja Linguagem de Confecção de Scripts para detalhes de como escrever um script.

source: See Special Keys.
pt_br: Vide Teclas Especiais.

source: See download page of AutoHotkey.
pt_br: Vide a página de download do AutoHotkey.

source: See Special Keys for details.
pt_br: Veja Teclas Especiais para detalhes.

source: See Functions for more details.
pt_br: Vide Funções para mais detalhes.

source: See Raw mode for details.
pt_br: Veja modo Bruto para detalhes.

source: See Hotkeys for details.
pt_br: Vide Hotkeys para detalhes.

source: See Wikipedia's Indentation style page for various styles and examples.
pt_br: Veja o artigo Indentation Style na Wikipédia em inglês para ver vários estilos e exemplos.

source: See also Command Line Parameter "Script Filename" and Portability of AutoHotkey.exe.
pt_br: Veja também Parâmetro da Linha de Comando "Nome do Arquivo de Script" e Portabilidade do AutoHotkey.exe.

source: See the command and function list for examples.
pt_br: Veja a lista de comandos e funções para exemplos.

source: Select the menu item "View->Key history"
pt_br: Selecione o item de menu “View->Key history”.

source: Selected tab:
pt_br: Guia selecionada:

source: Send - Syntax & Usage | AutoHotkey
pt_br: Send - Sintaxe e uso | AutoHotkey

source: Send Hello`, world!
pt_br: Send Olá`, mundo!

source: Send does not wait for Win to be released even if the text contains an L keystroke.
pt_br: O comando Send não aguarda a soltura da tecla WinWin mesmo se o texto contiver um pressionamento incluindo a tecla L.

source: Send variants
pt_br: Variantes do comando Send

source: Send {KEY down}
pt_br: Send {TECLA down}

source: Send {KEY down}{KEY up}
pt_br: Send {TECLA down}{TECLA up}

source: Send {KEY up}
pt_br: Send {TECLA up}

source: Send, 7 lines{!}{Enter}
pt_br: Send, 7 linhas!{!}{Enter}

source: Send, Multiple Enter lines have Enter been sent.
pt_br: Send, Acabei de criar novas linhas teclando Enter várias vezes.

source: Send, Multiple{Enter}lines have{Enter}been sent.
pt_br: Send, Acabei de criar novas linhas teclando {Enter} várias vezes.

source: Send, My First Script
pt_br: Send, Meu primeiro script

source: Send, This text has been typed{!}
pt_br: Send, Este texto foi digitado{!}

source: Send, ack
pt_br: Send, enrique

source: SendInput, This is awesome{!}{!}{!}
pt_br: SendInput, Isto é magnífico{!}{!}{!}

source: SendInput, inside the CTRL{+}J hotkey.
pt_br: SendInput, dentro da hotkey Ctrl{+}J.

source: SendPlay may have no effect at all on Windows Vista or later if User Account Control is enabled, even if the script is running as an administrator.
pt_br: SendPlay pode não ter efeito algum no Windows Vista ou posterior se o Controle de Conta do Usuário (UAC) estiver habilitado, mesmo que o script esteja rodando como administrador.

source: Sending Keystrokes
pt_br: Enviando pressionamentos de teclas

source: Sending {CapsLock} might require SetStoreCapsLockMode Off beforehand.
pt_br: Enviar {CapsLock} pode exigir que se declare SetStoreCapsLockmode Off antes.

source: Sends Alt.
pt_br: Envia Alt.

source: Sends Ctrl.
pt_br: Envia Ctrl.

source: Sends Shift.
pt_br: Envia Shift.

source: Sends Win (the key with the Windows logo) therefore Send #e would hold down Win and then press E.
pt_br: Envia Win (a tecla do logo do Windows), portanto Send #e faz segurar a tecla Win e então pressionar E.

source: Sends simulated keystrokes and mouse clicks to the active window.
pt_br: Envia pressionamentos de tecla e cliques do mouse simulados para a janela ativa.

source: Sets the uiAccess attribute in each UIA file's embedded manifest.
pt_br: Define o atributo uiAccess no manifesto embutido em cada arquivo UIA.

source: Setting values in an object is as simple as setting the value of a variable.
pt_br: Definir valores em um objeto é tão simples quanto definir o valor de uma variável.

source: Setup will attempt to launch the scripts via Explorer, so they do not run as administrator if UAC is enabled.
pt_br: A instalação vai tentar executar os scripts via Explorer, então eles não serão executados como administrador se o UAC estiver ativo.

source: ShellExecute can be used instead.
pt_br: ShellExecute pode ser usado no lugar.

source: Short answer:
pt_br: Resposta curta:

source: Sidebar visibility:
pt_br: Visibilidade da barra lateral:

source: Similarly, the middle button and the turning of the mouse wheel should be assignable normally except on mice whose drivers directly control those buttons.
pt_br: De maneira similar, o botão do meio e o rolar da roda do mouse devem ser atribuíveis normalmente exceto em mouses cujos drivers controlam diretamente tais botões.

source: Simple!
pt_br: Simples!

source: Simply replace the command name "Send" with one of the following:
pt_br: Simplesmente substitua o comando de nome “Send” por outro dentre os seguintes:

source: Simply specify a window title.
pt_br: Simplesmente especifique um título de janela.

source: Simply specify an opening parenthesis on a new line, then your content, finally a closing parenthesis on its own line.
pt_br: Apenas insira um “abre-parênteses” numa nova linha, depois insira seu código e finalmente feche o parêntese em uma linha só dele.

source: Simply type in your text and done.
pt_br: Simplesmente digite seu texto e pronto.

source: Since numbers are more memory-efficient, if a variable has both, the number is used (except for floating-point values used as keys).
pt_br: Dado que números são mais eficientes no consumo de memória, se uma variável possui ambos, o número é usado (exceto valores de ponto flutuante usados como chaves).

source: Since you're viewing this documentation locally, you've probably already installed AutoHotkey and can skip to section b.
pt_br: Já que você está lendo esta documentação localmente, você provavelmente já instalou o AutoHotkey e pode pular para a seção b.

source: Small
pt_br: Pequena

source: Small code (25 lines or less) will probably be fine to read without indentation, but it'll soon get sloppy.
pt_br: Pequenos códigos (25 linhas ou menos) serão provavelmente fáceis de se ler sem indentação, mas daqui a pouco vai ficar desleixado.

source: So I'll set it clear:
pt_br: Então vou deixar claro:

source: So a command would look like this:
pt_br: Então um comando se parecerá com isto:

source: So it won't be covered in the tutorial, at least, not right now.
pt_br: Então não vamos tratar das exceções neste tutorial, pelo menos não agora.

source: So no need for a bunch of Send commands with one letter each.
pt_br: Então não precisa de um bando repetições do comando Send para cada letra.

source: So now that you have created a script, we need to add stuff into the file.
pt_br: Então agora que você criou um script, temos que adicionar algumas linhas ao arquivo.

source: So now you decided that you want to send (type) keys to a program.
pt_br: Então você decidiu que você quer enviar (digitar) teclas em um programa.

source: So please remember to check the table on the Send page and make sure you have your brackets in the right places.
pt_br: Então por favor lembre-se de conferir a tabela na página do comando Send e certifique-se que você inseriu as chaves nos lugares certos.

source: So thanks to Jon and the other AutoIt authors for those as well.
pt_br: Então obrigado ao Jon e aos outros autores do AutoIt por elas também.

source: So try ALL of these before giving up.
pt_br: Então tente TODOS os métodos a seguir antes de desistir.

source: So we either open Notepad or activate Notepad depending on whether it is already running.
pt_br: Então ou abrimos o Bloco de Notas ou ativamos sua janela dependendo de ele já estar ou não em execução.

source: So we will need to tell it what to do.
pt_br: Então nós precisamos dizer a ele o que fazer.

source: So you could simply do this if you wanted:
pt_br: Então você pode simplesmente fazer isso se você quiser:

source: Software License:
pt_br: Licença do Software:

source: Some COM objects throw an exception if the wrong type of value is passed.
pt_br: Alguns objetos COM lançam uma exceção se o tipo errado de valor for passado.

source: Some configurations of Windows IME (such as Japanese input with English keyboard) use CapsLock to toggle between modes.
pt_br: Algumas configurações do Editor de Método de Entrada do Windows (como entrada em japonês com teclado americano) usam a tecla CapsLock para alternar entre os modos.

source: Some examples:
pt_br: Alguns exemplos:

source: Some functions might do no more than perform a simple calculation, while others have immediately visible effects, such as moving a window.
pt_br: Algumas funções fazem não mais que realizar um simples cálculo, enquanto outras têm efeitos imediatamente visíveis, como mover uma janela.

source: Some keys do not generate events and thus will not be visible here.
pt_br: Algumas teclas não geram eventos e, por isso, não serão visíveis aqui.

source: Some other related concepts:
pt_br: Alguns outros conceitos relacionados:

source: Some parameters can be omitted, in which case the parameter can be left blank, but the comma following it can only be omitted if all remaining parameters are also omitted.
pt_br: Alguns parâmetros podem ser omitidos, caso em que o parâmetro deve ser deixado em branco, mas a vírgula seguinte só pode ser omitida se todos os parâmetros que vierem depois também forem omitidos.

source: Some programs need to be started in their own directories (when in doubt, it is usually best to do so).
pt_br: Alguns programas precisam ser iniciados em seus próprios diretórios (quando em dúvida, costuma ser melhor fazê-lo).

source: Some special variables are not updated periodically, but rather their value is retrieved or calculated whenever the script references the variable.
pt_br: Há também algumas variáveis especiais que não são atualizadas periodicamente; em vez disso, seus valores são obtidos ou calculados toda vez que o script referencia essa variável.

source: Some variables such as A_KeyDelay and A_TitleMatchMode represent settings that control the script's behavior, and retain separate values for each thread.
pt_br: Algumas variáveis como A_KeyDelay e A_TitleMatchMode representam configurações que controlam o comportamento do script, e retêm valores separados para cada fio de execução.

source: Some windows refuse to be automated (e.g. Device Manager ignores Send).
pt_br: Algumas janelas se recusam a ser automatizadas (ex: Gerenciador de Dispositivos ignora o comando Send).

source: Sometime you might want a hotkey or hotstring to only work (or be disabled) in a certain window.
pt_br: Às vezes você pode querer que uma hotkey ou hotstring só funcione (ou fique desabilitada) em uma determinada janela.

source: Sometimes games have a hack and cheat prevention measure, such as GameGuard and Hackshield.
pt_br: Às vezes os jogos têm medidas de prevenção de hack ou cheats, como GameGuard e Hackshield.

source: Sometimes it's a mix of both, and sequential numbers too!
pt_br: E outras vezes são um misto de ambos, e números em sequência também!

source: Sometimes objects are referred to as arrays, but it's important to note that all arrays are just objects.
pt_br: Algumas vezes os objetos são referidos como vetores, mas é importante notar que vetores são só objetos.

source: Sometimes system policies or other factors prevent the files from being extracted or executed.
pt_br: Algumas vezes as políticas do sistema ou outros fatores impedem arquivos de serem extraídos ou executados.

source: Sometimes these options are overridden by settings in the current user's profile, such as if Open With has been used to change the default program for opening .ahk files.
pt_br: Algumas vezes essas opções são sobrescritas por configurações do perfil do usuário atual, como se Abrir Com tivesse sido usada para mudar o programa padrão para abrir arquivos .ahk.

source: Sometimes you want to have the user to choose the value of stuff.
pt_br: De vez em quando você pode querer que o usuário escolha o valor das coisas.

source: Somewhere near the bottom are the key-down and key-up events for your key.
pt_br: Em algum lugar perto do fim estão listados os eventos de pressionamento e soltura da sua tecla.

source: Special Keys
pt_br: Teclas Especiais

source: Special modes
pt_br: Modos especiais

source: Specifically, send a key-up to modify the state of the IME, but prevent any other effects by signalling the keyboard hook to suppress the event.
pt_br: Especificamente, enviar um comando de soltura de tecla para modificar o estado do IME, mas prevenir quaisquer outros efeitos sinalizando o gancho do teclado para suprimir o evento.

source: Specify for nn the hexadecimal virtual key code of a key.
pt_br: Especifique com o código virtual hexadecimal nn de uma tecla.

source: Specify for nnn the scan code of a key.
pt_br: Especifique com o código nnn de leitura da tecla.

source: Specify the settings the help should be started with by default.
pt_br: Escolha as configurações com as quais esta ajuda deve iniciar por padrão.

source: Square brackets signify that the enclosed parameters are optional (the brackets themselves should not appear in the actual code).
pt_br: A presença de colchetes nos parâmetros significa que eles são parâmetros opcionais (os colchetes em si não devem aparecer no código).

source: Statement
pt_br: Instrução

source: Stop
pt_br: Parar

source: String Encoding
pt_br: Codificação de Strings

source: Strings which are passed directly to or from DllCall() can be converted to ANSI or UTF-16 by using the AStr or WStr parameter types.
pt_br: Strings que são passadas diretamente de ou para DllCall() podem ser convertidas para ANSI ou UTF-16 usando-se os tipos de parâmetros AStr ou WStr.

source: SubStr("I'm scripting, awesome!", 16)
pt_br: SubStr("Estou escrevendo código, maravilha!", 16)

source: Such a keystroke can then be defined as a hotkey in a script.
pt_br: O dito pressionamento pode então ser definido como uma hotkey em um script.

source: Such additions and changes are not seen by the rest of the system.
pt_br: Tais adições e alterações não são vistas pelo resto do sistema.

source: Such numeric names cannot be used in expressions because they would be seen as numbers rather than variables.
pt_br: Esses nomes numéricos não podem ser usados em expressões porque eles seriam vistos como números e não como variáveis.

source: Such strings can be created with VarSetCapacity() and NumPut() or DllCall(), but may produce inconsistent results.
pt_br: Tais strings podem ser criadas com VarSetCapacity() e NumPut() ou DllCall(), mas podem gerar efeitos inconsistentes.

source: Suspend Hotkeys - Suspend or unsuspend hotkeys.
pt_br: Suspend Hotkeys - Suspende ou reabilita as hotkeys.

source: Symbol
pt_br: Símbolo

source: Table of Contents
pt_br: Sumário

source: Taking the address of a variable effectively converts the variable's value to a string, disabling caching until the variable's address changes (this happens when its capacity changes).
pt_br: Tomar o endereço de uma variável efetivamente converte o valor da variável em uma string, desabilitando o cache até que o endereço da variável mude (isso acontece quando sua capacidade muda).

source: Technically, value is passed as the last the parameter of the Set message; however, this detail is almost never relevant to script authors.
pt_br: Tecnicamente, o valor é passado como último parâmetro da mensagem Set, entretanto, esse detalhe quase nunca é relevante para autores de scripts.

source: Techniques for dealing with the differences between ANSI and Unicode versions of AutoHotkey can be found under Unicode vs ANSI.
pt_br: Técnicas para lidar com as diferenças entre as versões ANSI e Unicode do AutoHotkey podem ser encontradas na página Unicode x ANSI.

source: Testing shows that due to file caching, a temporary file can be very fast for relatively small outputs.
pt_br: Testes mostram que devido ao cache de arquivos, um arquivo temporário pode ser bem rápido para pequenas saídas.

source: Text editors with AutoHotkey support
pt_br: Editores de texto com suporte ao AutoHotkey

source: Text instructions:
pt_br: Instruções em texto:

source: Text mode [v1.1.27+]
pt_br: Modo texto [v1.1.27+]

source: Text needs to be wrapped in quotes:
pt_br: Texto deve ser envolto em aspas:

source: Thanks to expressions, you can do math!
pt_br: Graças às expressões, você pode fazer operações matemáticas!

source: That fixes some DirectX issues.
pt_br: Isso resolverá alguns problemas relacionados ao DirectX.

source: That is FALSE.
pt_br: Isso é FALSO.

source: That is, Send omits the extra keystrokes that would otherwise be sent in order to prevent:
pt_br: Isto é, o comando Send omite os pressionamentos de tecla extras que, de outro modo, seriam enviados, de forma a impedir:

source: That way, anyone reading the script can see what variables the script will be using and what starting values they are expected to have.
pt_br: Dessa forma, qualquer pessoa lendo o script pode ver quais variáveis o script usará e quais valores iniciais espera-se que elas tenham.

source: That's fancy talk for "do pretty much anything".
pt_br: Essa é uma maneira pomposa de dizer “fazer praticamente qualquer coisa”.

source: The #IfWin directives are positional:
pt_br: As diretivas #IfWin são posicionais:

source: The $ prefix is needed to prevent a warning dialog about an infinite loop (since the hotkey "sends itself").
pt_br: O prefixo $ é necessário para prevenir o aparecimento de um aviso sobre um loop infinito (já que a hotkey "envia ela própria").

source: The 12 or more function keys at the top of most keyboards.
pt_br: As 12 ou mais teclas de função que ficam na parte de cima da maioria dos teclados.

source: The 5th and 6th axes of the joystick.
pt_br: o 5º e o 6º eixos do joystick.

source: The #NoTrayIcon directive can be used to hide the tray icon.
pt_br: A diretiva #NoTrayIcon pode ser usada para ocultar o ícone da bandeja.

source: The EnvAdd command can add or subtract a quantity of days, hours, minutes, or seconds to a time-string that is in the YYYYMMDDHH24MISS format.
pt_br: O comando EnvAdd pode adicionar ou subtrair uma quantidade de dias, horas, minutos ou segundos de uma string de tempo que esteja no formato YYYYMMDDHH24MISS.

source: The Menu command can be used to customise the tray icon and menu.
pt_br: O comando Menu pode ser usado para personalizar o ícone da bandeja e o menu relacionado.
